Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["external-dns"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--external-dns"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--external-dns"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--external-dns"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["external-dns"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--external-dns"
    }

  # module.irsa["external-secrets"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-external-secrets:external-secrets",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["external-secrets"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--external-secrets policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--external-secrets"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:Get*",
                          + "ssm:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/bruce/*",
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/common/*",
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/daangn/*",
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/opspresso/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/bruce/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/common/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/daangn/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/opspresso/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["external-secrets"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--external-secrets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--external-secrets"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--external-secrets"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["external-secrets"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--external-secrets"
    }

  # module.irsa["irsa-operator"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-irsa-operator:irsa-operator",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["irsa-operator"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--irsa-operator policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--irsa-operator"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::*:policy/irsa-operator/*",
                          + "arn:aws:iam::*:role/irsa-op-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "iam:Get*",
                          + "iam:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["irsa-operator"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--irsa-operator"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--irsa-operator"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--irsa-operator"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["irsa-operator"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--irsa-operator"
    }

  # module.irsa["karpenter"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-karpenter:karpenter",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["karpenter"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-a--karpenter policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-a--karpenter"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:RunInstances",
                          + "ec2:CreateTags",
                          + "iam:PassRole",
                          + "ec2:TerminateInstances",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["karpenter"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-a--karpenter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-a--karpenter"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-a--karpenter"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["karpenter"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-a--karpenter"
    }

  # module.monitoring-v1.data.aws_ami.worker will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ami" "worker" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "602401143452",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + (known after apply),
            ]
        }

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.monitoring-v1.data.aws_sqs_queue.nth[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_sqs_queue" "nth" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = (known after apply)
      + tags = (known after apply)
      + url  = (known after apply)
    }

  # module.monitoring-v1.aws_autoscaling_group.worker[0] will be created
+ resource "aws_autoscaling_group" "worker" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingCapacity",
          + "GroupPendingInstances",
          + "GroupStandbyCapacity",
          + "GroupStandbyInstances",
          + "GroupTerminatingCapacity",
          + "GroupTerminatingInstances",
          + "GroupTotalCapacity",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "subnet-0a7db5a0fef954bb8",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = (known after apply)
          + propagate_at_launch = (known after apply)
          + value               = (known after apply)
        }
    }

  # module.monitoring-v1.aws_autoscaling_lifecycle_hook.nth[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "nth" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "aws-node-termination-handler"
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_asg" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_scheduled" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_spot" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_state[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_state" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_target.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_asg" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_target.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_scheduled" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_target.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_spot" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_target.nth_state[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_state" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.monitoring-v1.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + role        = "eks-demo-a-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.monitoring-v1.aws_launch_template.worker_spot[0] will be created
+ resource "aws_launch_template" "worker_spot" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = "m6i.large"
      + key_name        = "bruce-seoul"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = (known after apply)
      + tags_all        = (known after apply)
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + ipv6_address_count          = 0
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
    }

  # module.workers-v1.data.aws_ami.worker will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ami" "worker" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "602401143452",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + (known after apply),
            ]
        }

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.workers-v1.data.aws_sqs_queue.nth[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_sqs_queue" "nth" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = (known after apply)
      + tags = (known after apply)
      + url  = (known after apply)
    }

  # module.workers-v1.aws_autoscaling_group.worker[0] will be created
+ resource "aws_autoscaling_group" "worker" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingCapacity",
          + "GroupPendingInstances",
          + "GroupStandbyCapacity",
          + "GroupStandbyInstances",
          + "GroupTerminatingCapacity",
          + "GroupTerminatingInstances",
          + "GroupTotalCapacity",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "subnet-01baefaafd9a5d53b",
          + "subnet-0a7db5a0fef954bb8",
          + "subnet-0e480aadf4a64c2bf",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = (known after apply)
          + propagate_at_launch = (known after apply)
          + value               = (known after apply)
        }
    }

  # module.workers-v1.aws_autoscaling_lifecycle_hook.nth[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "nth" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "aws-node-termination-handler"
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_asg" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_scheduled" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_spot" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_state[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_state" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_asg" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_scheduled" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_spot" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_state[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_state" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + role        = "eks-demo-a-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.workers-v1.aws_launch_template.worker_spot[0] will be created
+ resource "aws_launch_template" "worker_spot" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = "c6i.large"
      + key_name        = "bruce-seoul"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = (known after apply)
      + tags_all        = (known after apply)
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + ipv6_address_count          = 0
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
    }

Plan: 84 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_endpoint      = (known after apply)
+ cluster_name          = "eks-demo-a"
+ cluster_oidc_arn      = (known after apply)
+ cluster_oidc_url      = (known after apply)
+ cluster_role_name     = "eks-demo-a-cluster"
+ cluster_version       = "1.23"
+ cluster_vpc_config    = {
      + cluster_security_group_id = (known after apply)
      + endpoint_private_access   = true
      + endpoint_public_access    = true
      + public_access_cidrs       = (known after apply)
      + security_group_ids        = (known after apply)
      + subnet_ids                = [
          + "subnet-01baefaafd9a5d53b",
          + "subnet-0a7db5a0fef954bb8",
          + "subnet-0e480aadf4a64c2bf",
        ]
      + vpc_id                    = (known after apply)
    }
+ irsa                  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
+ worker_role_name      = "eks-demo-a-worker"
+ worker_security_group = [
      + (known after apply),
      + "sg-07c699460cd936bb8",
    ]

time="2022-09-07T09:42:56Z" level=info msg="Detected Terraform plan JSON file at /atlantis-data/repos/opspresso/terraform-env-demo/13/default/demo/8-eks-a/default.json"
time="2022-09-07T09:42:56Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-09-07T09:42:56Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"
time="2022-09-07T09:42:57Z" level=info msg="Output saved to /tmp/opspresso-terraform-env-demo-13/infracost-output.json"

Comment posted to GitHub

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d demo/8-eks-a`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo.nalbam.com/lock?id=opspresso%252Fterraform-env-demo%252Fdemo%252F8-eks-a%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d demo/8-eks-a`
</details>
Plan: 84 to add, 0 to change, 0 to destroy.

---
### 2. dir: `demo/9-eks-b` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.alb: Reading...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.alb: Read complete after 1s
module.irsa["aws-ebs-csi-driver"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Reading...
module.monitoring-v1.data.aws_ssm_parameter.docker_config: Reading...
module.irsa["aws-efs-csi-driver"].data.aws_caller_identity.current: Reading...
module.workers-v1.data.aws_caller_identity.current: Reading...
module.irsa["external-secrets"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.irsa["external-dns"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.irsa["irsa-operator"].data.aws_caller_identity.current: Reading...
module.irsa["karpenter"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node-termination-handler"].data.aws_caller_identity.current: Reading...
module.workers-v1.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-load-balancer-controller"].data.aws_caller_identity.current: Reading...
module.irsa["irsa-operator"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-efs-csi-driver"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["cluster-autoscaler"].data.aws_caller_identity.current: Reading...
module.irsa["aws-node"].data.aws_caller_identity.current: Reading...
module.irsa["aws-load-balancer-controller"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_subnets.c: Reading...
module.irsa["external-secrets"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["cluster-autoscaler"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["external-dns"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.monitoring-v1.data.aws_ssm_parameter.docker_config: Read complete after 0s [id=/k8s/common/docker-config]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-node"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-node-termination-handler"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.irsa["aws-ebs-csi-driver"].data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_subnets.a: Reading...
module.monitoring-v1.data.aws_caller_identity.current: Reading...
module.workers-v1.data.aws_ssm_parameter.docker_config: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_group.master[0]: Reading...
data.aws_subnets.b: Reading...
data.aws_subnets.a: Read complete after 0s [id=ap-northeast-2]
module.monitoring-v1.data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
data.aws_caller_identity.current: Read complete after 0s [id=082867736673]
module.workers-v1.data.aws_ssm_parameter.docker_config: Read complete after 0s [id=/k8s/common/docker-config]
data.aws_subnets.c: Read complete after 0s [id=ap-northeast-2]
data.aws_subnets.b: Read complete after 1s [id=ap-northeast-2]
module.eks.data.aws_iam_group.master[0]: Read complete after 1s [id=AGPARGS2NKBQ5AE36UBZS]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ssm_parameter.cluster_oidc_url will be created
+ resource "aws_ssm_parameter" "cluster_oidc_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s/common/eks-demo-b/cluster_oidc_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_role_name will be created
+ resource "aws_ssm_parameter" "cluster_role_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s/common/eks-demo-b/cluster_role_name"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_version will be created
+ resource "aws_ssm_parameter" "cluster_version" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/k8s/common/eks-demo-b/cluster_version"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.eks.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.aws_cloudwatch_log_group.cluster will be created
+ resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/eks/eks-demo-b-"
      + retention_in_days = 7
      + tags              = {
          + "Environment"                      = "demo"
          + "KubernetesCluster"                = "eks-demo-b"
          + "Name"                             = "eks-demo-b"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + tags_all          = {
          + "Environment"                      = "demo"
          + "KubernetesCluster"                = "eks-demo-b"
          + "Name"                             = "eks-demo-b"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
    }

  # module.eks.aws_eks_addon.aws-ebs-csi-driver[0] will be created
+ resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name               = "aws-ebs-csi-driver"
      + addon_version            = "v1.10.0-eksbuild.1"
      + arn                      = (known after apply)
      + cluster_name             = "eks-demo-b"
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + resolve_conflicts        = "OVERWRITE"
      + service_account_role_arn = "arn:aws:iam::082867736673:role/irsa--eks-demo-b--aws-ebs-csi-driver-sa"
      + tags_all                 = (known after apply)
    }

  # module.eks.aws_eks_addon.coredns[0] will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name        = "coredns"
      + addon_version     = "v1.8.7-eksbuild.2"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-b"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.kube-proxy[0] will be created
+ resource "aws_eks_addon" "kube-proxy" {
      + addon_name        = "kube-proxy"
      + addon_version     = "v1.23.7-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-b"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.vpc-cni[0] will be created
+ resource "aws_eks_addon" "vpc-cni" {
      + addon_name        = "vpc-cni"
      + addon_version     = "v1.11.3-eksbuild.1"
      + arn               = (known after apply)
      + cluster_name      = "eks-demo-b"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_cluster.cluster will be created
+ resource "aws_eks_cluster" "cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-demo-b"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Name"        = "eks-demo-b"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Name"        = "eks-demo-b"
        }
      + version               = "1.23"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-01baefaafd9a5d53b",
              + "subnet-0a7db5a0fef954bb8",
              + "subnet-0e480aadf4a64c2bf",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "eks-demo-b-worker"
      + path        = "/"
      + role        = "eks-demo-b-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be created
+ resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-demo-b-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.worker will be created
+ resource "aws_iam_role" "worker" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-demo-b-worker"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-demo-b-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-demo-b-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-demo-b-worker"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-demo-b-worker"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "worker_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-demo-b-worker"
    }

  # module.eks.aws_security_group.cluster will be created
+ resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with Worker Nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-b-cluster"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-b-cluster"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-b-cluster"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + vpc_id                 = "vpc-0ba3703a78b7b8f5e"
    }

  # module.eks.aws_security_group.worker will be created
+ resource "aws_security_group" "worker" {
      + arn                    = (known after apply)
      + description            = "EKS worker node common security_group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-b-worker"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + vpc_id                 = "vpc-0ba3703a78b7b8f5e"
    }

  # module.eks.aws_security_group_rule.cluster_vpn will be created
+ resource "aws_security_group_rule" "cluster_vpn" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow vpn to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_worker will be created
+ resource "aws_security_group_rule" "cluster_worker" {
      + description              = "Allow workers to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster will be created
+ resource "aws_security_group_rule" "worker_cluster" {
      + description              = "Allow to communicate between master and workers (eks-demo-b-worker)"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_10250 will be created
+ resource "aws_security_group_rule" "worker_cluster_10250" {
      + description              = "Allow to communicate between master and workers (eks-demo-b-worker)"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_443 will be created
+ resource "aws_security_group_rule" "worker_cluster_443" {
      + description              = "Allow to communicate between master and workers (eks-demo-b-worker)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_source[0] will be created
+ resource "aws_security_group_rule" "worker_source" {
      + description              = "Allow to communicate between source and workers (eks-demo-b-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-02c7deaf03238d6a3"
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_ssh will be created
+ resource "aws_security_group_rule" "worker_ssh" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow to communicate between ssh and workers (eks-demo-b-worker)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_worker will be created
+ resource "aws_security_group_rule" "worker_worker" {
      + description              = "Allow to communicate between workers (eks-demo-b-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_sqs_queue.worker will be created
+ resource "aws_sqs_queue" "worker" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "eks-demo-b-worker"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "events.amazonaws.com",
                              + "sqs.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-b-worker"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + tags_all                          = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.eks.kubernetes_config_map.aws_auth will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::082867736673:role/eks-demo-b-worker"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/atlantis-ecs_task_execution"
                  "username": "atlantis"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-master"
                  "username": "k8s-master"
                - "groups": []
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-readonly"
                  "username": "k8s-readonly"
            EOT
          + "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/ops"
                  "username": "iam-user-ops"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/bruce"
                  "username": "iam-user-bruce"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/jungyoul.yu"
                  "username": "iam-user-jungyoul.yu"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
     
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.